app/controllers/items_controller.rb

  def update
    @item = Item.find(params[:id])
    if @item.sold
      flash[:alert] = "You cannot edit an item that has been sold!"
      redirect_to items_path
    end
    if @item.user_id != current_user.id
      flash[:alert] = "You cannot edit an item that you do not own!"
      redirect_to items_path
    end

    if @item.update(item_params)
      redirect_to sellers_path, notice: 'Item was successfully updated.'
    else
      if @item.errors[:price].any?
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]